# 2) კვადრატი დავხაზოთ "*",  for/while

   
# გარეთა ლუპი, კვადრატის რიგებისთვის
for rows in range(5):
   #შიგნითა ლუპი კვადრატის ვარსკვლავებისთვის
   for stars in range(9):
      #პრინტავს ვარსკვლავს 9-ჯერ ერთ ხაზში
      print("*", end = "")
   #ცარიელი პრინტით ვიწყებთ მომდევნო 9 ვარსკვლავს ახალი ხაზიდან
   print()
print("--------------------------------")
rows = 0
for rows in range(5):
   print("*********")

print("--------------------------------------")
   
rows = 0
while rows < 5:
   print("*********")
   rows +=1
   
print("--------------------------------------")
