# for i in range(100)
#   print("*" * i)
  
  
  # ფუნქციებს გადაეცემათ ()-ში არგუმენტები, მაგალითები
  # range ---> 3 არგუმენტი,
  # range (start, end. step)
  
  # range(0, 10, 1)
  # 
  # range(10)
  
for i in range(5, 10, 1):
     print(i)
    
# for loop-ის თითოეული ნაწილის განხილვა
# for არის ქივორდი იტერაციისთვის(ანუ განმეორებისთვის)
# i არის ცვლადი, რომელიც იღებს მნიშვნელობას ჩამონათვალიდან (მაგალითად 0-დან 9-ის ჩათვლით ციფრებს)
# in უკონკრეტებს i ცვლადს, რომელი ჩამონათვალიდან აიღოს მნიშვნელობები
# range(10)  ფუნქცია გვაძლევს რიცხვების ჩამონათვალს 0-დან 9-ის ჩათვლით.
# გაამეორე ორი წერტილის შემდეგ მოყვანილი კოდის ბლოკი i-ს ყოველ იტერაციაზე(ანუ ყოველ ჯერზე, როდესაც i ცვლადი ახალ მნიშვნელობას იღებს)

for i in range(10): # მოცემულ განცხადებაში for თანმიმდევრობით უცვლის i ცვლადს მნიშვნელობას 0-დან 9-მდე.
   print("ani")     # პრინტ განცხადება კი იშვება ყოველ ჯერზე, როდესაც i ცვლადი ახალ მნიშვნელობას იღებს.
   

# loop for / while

# while statement :
# while True/False

# while loop დეტალური განხილვა---------
i = 0, # ეს არის საიტერაციო ცვლადი, რომლის დახმარებითაც მოხდება განმეორება
while (i < 10): # შემდეგ ვწერთ whihle ქიბორდს(ქართულად სანამ) და გადავცემთ  მას პირობას, ამ შემთხვევაში მას გადაეცემა პირობა ----> სანამ ნაკლებია 10-ზე
  print(i) # ორ წერტილს შემდეგ უკვე იწერება ის მოქმედება, რაც უნდა მოხდეს პირობის დაკმაყოფილების შემთხვევაში, ანუ სანამ i ნაკლებია 10-ზე, დაიპრინტება i და მოემატება მას 1. როგორც კი i გახდება 10, i < 10 ეს პირობა უკვე მოგვცემს false-ს, რადგან 10<10 არის ტყუილი და for loop გაჩერდება
  i += 1  
  
  
  
  
  
  
  
  
i = 0
while i < 10:
     print("Umar!", i)
     # i = i + 1
     i += 1
     
print("--------------------------")

i = 10
while i > 0:
    print("umar!", i)
    i -= 1
    
print("---------------------------")   
    
user_password = input("enter your password: ")
password = "123"
while user_password != password:
    user_password = input("Please try again: ") 
print("login successfully!")