# დავპრინტოთ მოცემული ფიგურა
for i in range(10):
    print((i * "*") + (" " * (20- i * 2)) + (i * "*"))
    
# ----------ლუპის შექმნა ---------------
# თავდაპირველად ვქმნით ლუპს, სადაც i თანმიმდევრობით იღებს მნიშნელობებს, 0-დან 9-ის ჩათვლით რიცხვებიდან
# ყოველ ლუპზე i იზრდება ერთით, რაც ჩვენ შეგვიძლია გამოვიყენოთ იმისთვის, რომ ვაკონტროლოთ თითოეულ ხაზზე "*"-ების რაოდენობა.


# ---------- მარცხენა სამკუთხედი ----------------
# (i * "*") ეს ქმნის მარცხენა სამკუთხედს
# (i * "*") - ნიშნავს, რომ ყოველ იტერაციაზე "*" დაიპრინტება i-ჯერ.
# ანუ, როდესაც I იქნება 2, "*" დაიპრინტება 2-ჯერ--> **
# როდესაც იქნება 3, "*" დაიპრინტება 3-ჯერ ---> ***
# და ასე 9-ის ჩათვლით

# ---------შუა სამკუთხედი სფეისებისგან ----------
# (" " * (20 - i * 2)) ეს ქმნის შუა გადმობრუნებულ სამკუთხედს სფეისებისგან
# (20 - i * 2)) აკონტროლებს თითოეულ იტერაციაზე სფეისების რაოდნეობას
# 20 იმიტომ წერია, რომ შუა სამკუთხედის ფუძე დანარჩენი ორი სამკუთხედის ფუძეზე 2-ჯერ მეტი უნდა იყოს
# როდესაც i არის 0, დაიპრინტება 20 - 0 * 2 -------> 20 სფეისი
# როდესაც i არის 1, დაიპრინტება 20 - 1 * 2 -------> 18 სფეისი
# და ასე 9-ის ჩათვლით


# ---------მარჯვენა სამკუთხედი -------------
# შემდეგი (i * "*") უკვე ქმნის მარჯვენა სამკუთხედს ზუსტად იგივენაირად, როგორც შექმნა მარცხენა.

